
const responses = {



    





    "Привет": function() {
        return "Привет! Как дела?";
        
    },
    "привет": function() {
        return "Привет! Как дела?";
    },

    "Здарова": function() {
        return "Здаровааа родной! Как дела?";
    },
    "здарова": function() {
        return "Здаровааа родной! Как дела?";
    },

    "Здраствуйте": function() {
        return "Привет! Как дела?";
    },
    "здраствуйте": function() {
        return "Привет! Как дела?";
    },

    "как дела?": function() {
        return "У меня все отлично, а у тебя?";
    },

    "хорошо": function() {
        return "Это замечательно!";
    }, 
    "отлично": function() {
        return "Это замечательно!";
    }, 
    "прекрасно": function() {
        return "Это замечательно!";
    }, 
    
    "нормально": function() {
        return "Это замечательно!";
    }, 












    "Как тебя зовут?": function() {
        return "Меня зовут BoardBot";
    },
    
    "Как тебя зовут": function() {
        return "Меня зовут BoardBot";
    },
    
    "как тебя зовут": function() {
        return "Меня зовут BoardBot GPT";
    },
    

    "г1алг1а ви хьо?": function() {
        return "Ва, хьо ви?";
    },
    


    "хьач..": function() {
        return "ХЬАЧ КХОСТ ЙИ УБЕЙ НАС";
    },



























    
    "Что ты умеешь делать?": function() {
        return "Я являюсь помощником по сайту BOARDRIDERS, но и немного могу рассказать о себе, я с радостью отвечу:)!";
    },

    
    "Что ты умеешь": function() {
        return "Я являюсь помощником по сайту BOARDRIDERS, но и немного могу рассказать о себе, я с радостью отвечу:)!";
    },

    "что ты умеешь": function() {
        return "Я являюсь помощником по сайту BOARDRIDERS, но и немного могу рассказать о себе, я с радостью отвечу:)!";
    },

    "что ты умеешь?": function() {
        return "Я являюсь помощником по сайту BOARDRIDERS, но и немного могу рассказать о себе, я с радостью отвечу:)!";
    },

    










    
    "что ты умеешь делать?": function() {
        return "Я являюсь лишь помощником по сайту BOARDRIDERS, но и немного могу рассказать о себе, я с радостью отвечу:)!";
    },

    "Что ты умеешь делать?": function() {
        return "Я являюсь лишь помощником по сайту BOARDRIDERS, но и немного могу рассказать о себе, я с радостью отвечу:)!";
    },

    "что ты умеешь делать": function() {
        return "Я являюсь лишь помощником по сайту BOARDRIDERS, но и немного могу рассказать о себе, я с радостью отвечу:)!";
    },

    "что ты умеешь делать?": function() {
        return "Я являюсь лишь помощником по сайту BOARDRIDERS, но и немного могу рассказать о себе, я с радостью отвечу:)!";
    },








    "А ты на все сообщения отвечаешь?": function() {
        return "Не совсем, я не являюсь нейросетью, поэтому иногда могу не понять твое сообщение, ведь я был разработан довольно простым методом";
    },
   
    "А ты на все сообщения отвечаешь": function() {
        return "Не совсем, я не являюсь нейросетью, поэтому иногда могу не понять твое сообщение, ведь я был разработан довольно простым методом";
    },

    "а ты на все сообщения отвечаешь": function() {
        return "Не совсем, я не являюсь нейросетью, поэтому иногда могу не понять твое сообщение, ведь я был разработан довольно простым методом";
    },

    "А ты на все сообщения отвечаешь": function() {
        return "Не совсем, я не являюсь нейросетью, поэтому иногда могу не понять твое сообщение, ведь я был разработан довольно простым методои";
    },

    "а ты на все сообщения отвечаешь?": function() {
        return "Не совсем, я не являюсь нейросетью, поэтому иногда могу не понять твое сообщение, ведь я был разработан довольно простым методом";
    },



    "А ты на любые вопросы отвечаешь?": function() {
        return "Не совсем, я не являюсь нейросетью, поэтому иногда могу не понять твое сообщение, ведь я был разработан довольно простым методом";
    },
   
    "А ты на любые вопросы отвечаешь": function() {
        return "Не совсем, я не являюсь нейросетью, поэтому иногда могу не понять твое сообщение, ведь я был разработан довольно простым методом";
    },

    "а ты на любые вопросы отвечаешь": function() {
        return "Не совсем, я не являюсь нейросетью, поэтому иногда могу не понять твое сообщение, ведь я был разработан довольно простым методом";
    },

    "А ты на любые вопросы отвечаешь": function() {
        return "Не совсем, я не являюсь нейросетью, поэтому иногда могу не понять твое сообщение, ведь я был разработан довольно простым методом";
    },

    "а ты на любые вопросы отвечаешь?": function() {
        return "Не совсем, я не являюсь нейросетью, поэтому иногда могу не понять твое сообщение, ведь я был разработан довольно простым методом";
    },




    "дурак": function() {
        return "Я стараюсь не реагировать на такие выражения!";
    },
    

    "дебил": function() {
        return "Я стараюсь не реагировать на такие выражения!";
    },

    "идиот": function() {
        return "Я стараюсь не реагировать на такие выражения!";
    },

    

    "дубина": function() {
        return "Я стараюсь не реагировать на такие выражения!";
    },



    "тупица": function() {
        return "Я стараюсь не реагировать на такие выражения!";
    },


































    
    "Когда ты был разработан?": function() {
        return "Я был разработан 28.12.2023 в 1:00";
    },

    "Когда ты был разработан": function() {
        return "Я был разработан 28.12.2023 в 1:00";
    },

    "когда ты был разработан?": function() {
        return "Я был разработан 28.12.2023 в 1:00";
    },

    "когда ты был разработан": function() {
        return "Я был разработан 28.12.2023 в 1:00";
    },

    "Когда ты был разработан?": function() {
        return "Я был разработан 28.12.2023 в 1:00";
    },





    
    "Кем ты был разработан?": function() {
        return "Я был разработан студентом: Льянов Ахмед Борисович";
    },

    "кем ты был разработан?": function() {
        return "Я был разработан студентом: Льянов Ахмед Борисович";
    },

    "Кем ты был разработан": function() {
        return "Я был разработан студентом: Льянов Ахмед Борисович";
    },

    "кем ты был разработан": function() {
        return "Я был разработан студентом: Льянов Ахмед Борисович";
    },
    



    
    
    "Кто разработчик проекта?": function() {
        return "Разработчиком проекта является Льянов Ахмед Борисович";
    },

    "кто разработчик проекта?": function() {
        return "Разработчиком проекта является Льянов Ахмед Борисович";
    },

    "Кто разработчик проекта": function() {
        return "Разработчиком проекта является Льянов Ахмед Борисович";
    },

    "кто разработчик проекта": function() {
        return "Разработчиком проекта является Льянов Ахмед Борисович";
    },










    "Могу ли я узнать больше о нем?": function() {
        return "У вас нет доступа к такой информации";
    },

    "могу ли я узнать больше о нем?": function() {
        return "У вас нет доступа к такой информации";
    },
    "Могу ли я узнать больше о нем": function() {
        return "У вас нет доступа к такой информации";
    },

    "могу ли я узнать больше о нем": function() {
        return "У вас нет доступа к такой информации";
    },








    "Cколько страниц сделано в этом проекте?": function() {
        return "В проекте BOARDRIDERS сделано 4 страницы";
    },

    "сколько страниц сделано в этом проекте": function() {
        return "В проекте BOARDRIDERS сделано 4 страницы";
    },

    "сколько страниц сделано в этом проекте?": function() {
        return "В проекте BOARDRIDERS сделано 4 страницы";
    },







    "Какая у тебя версия?": function() {
        return "На данный момент у меня версия:" + version;
    },

    "какая у тебя версия": function() {
        return "На данный момент у меня версия:" + version;
    },
    "какая у тебя версия?": function() {
        return "На данный момент у меня версия:" + version;
    },
    "Какая у тебя версия": function() {
        return "На данный момент у меня версия:" + version;
    },

























    








    "расскажи о себе": function() {
        return "Хорошо, мое имя Board (Полное: BoardBot GPT) как ты наверно уже знаешь я являюсь ботом-ассистентом проекта BOARDRIDERS, меня разрабатывал сам владелец проекта Льянов Ахмед Борисович, моей главной целью является помогать клиентам осваивать сайт. Конечно я не могу сказать что я прям супер крутой GPT который умеет решать задачи, обрабатывать фото или видео, я простой веб-помощник. Если у тебя возникнут вопросы связанные с этим проектом не стесняйся, я всегда готов ответить! ";
    },






















    












   
};

function respondToMessage(event) {
    if (event.key === 'Enter') {
        let userInput = document.getElementById("userInput").value;
        let botResponse = generateResponse(userInput);
        document.getElementById("botResponse").innerText = "BoardBot: " + botResponse;

        
        document.getElementById("userInput").value = "";
    }
}

function generateResponse(input) {
  
    input = input.toLowerCase();


    if (responses[input]) {
        return responses[input]();
    } else {
        return "Извини, но я не понял твое сообщение, возможно ты допустил ошибку";
    }
}


let version = "BoardGPT 1.0"


















